# https://github.com/Homebrew/homebrew-bundle

# ```sh
# brew tap bundle
# brew bundle --global
# ```

tap 'homebrew/bundle'

# fonts
tap 'homebrew/cask-fonts'

cask 'font-fontawesome'
cask 'font-hack'

# applications
cask 'alfred'
cask 'appcleaner'
cask 'basictex'
cask 'bitwarden'
cask 'calibre'
cask 'charles'
cask 'chromium'
cask 'daisydisk'
cask 'dropbox'
cask 'firefox'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kobo'
cask 'licecap'
cask 'liteicon'
cask 'mpv'
cask 'pocket-casts'
cask 'postico'
cask 'prey'  # requires API_KEY
cask 'rstudio'
cask 'slack'
cask 'spotify'
cask 'ssh-tunnel-manager'
cask 'tex-live-utility'
cask 'thunderbird'
cask 'xquartz'
cask 'zoom'

# command line
brew 'ag'
brew 'antigen'
brew 'awscli'
brew 'bitwarden-cli'
brew 'cabal-install'
brew 'cocoapods'
brew 'csvkit'
brew 'curl'
brew 'docker'
brew 'docker-machine'
brew 'drake'
brew 'fasd'
brew 'fswatch'
brew 'git'
brew 'gmime'
brew 'gnupg2'
brew 'gnutls'
brew 'hadoop'
brew 'imagemagick'
brew 'java'
brew 'jq'
brew 'leiningen'
brew 'libcaca'
brew 'lua'
brew 'maven'
brew 'openssl'
brew 'p7zip'
brew 'pandoc'
brew 'pgcli'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pow'
brew 'pspg'
brew 'python'
brew 'R'
brew 'ranger'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'scala', args: ['with-docs']
brew 'scalastyle'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'trash'
brew 'unixodbc'
brew 'vim'
brew 'vimpager'
brew 'xclip'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zsh'

# linuxifacation
brew 'coreutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

# email
brew 'mu'
brew 'offlineimap'

# Emacs
tap 'd12frosted/emacs-plus'
brew 'aspell'
brew 'emacs-plus', args: ['with-dbus', 'with-mailutils']
brew 'ghostscript'  # for doc-view-mode
brew 'ispell'
brew 'surfraw'  # for the helm-surfraw command
