# https://github.com/Homebrew/homebrew-bundle

# ```sh
# brew bundle --global
# ```

tap 'vjeantet/tap'
tap 'getmacro/terminal'
tap 'guillemcastro/spotify-dl'
tap 'jordond/tap'
tap 'mutagen-io/mutagen'
tap 'oven-sh/bun'
tap 'runpod/runpodctl'
tap 'snowflakedb/snowflake-cli'

# fonts
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-roboto'

# applications
cask 'android-file-transfer'
cask 'android-platform-tools'
cask 'anki'
cask 'appcleaner'
cask 'basictex'
cask 'bitcoin-core'
cask 'bitwarden'
cask 'brave-browser'
cask 'bruno'
cask 'calibre'
cask 'charles'
cask 'claude'
cask 'claude-code'
cask 'cmux'
cask 'comfyui'
cask 'cursor'
cask 'discord'
cask 'docker-desktop'
cask 'dropbox'
cask 'emclient'
cask 'fantastical'
cask 'firefox'
cask 'garmin-express'
cask 'ghostty'
cask 'goldencheetah'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'kiro'
cask 'kobo'
cask 'launchcontrol'
cask 'ledger-wallet'
cask 'licecap'
cask 'lm-studio'
cask 'logseq'
cask 'stolendata-mpv'
cask 'mullvad-vpn'
cask 'obsidian'
cask 'ollama-app'
cask 'opencode-desktop'
cask 'plex'
cask 'pocket-casts'
cask 'polypane'
cask 'positron'
cask 'postico'
cask 'postman'
cask 'prince'
cask 'proxyman'
cask 'qfinder-pro'
cask 'qgis'
cask 'quarto'
cask 'raycast'
cask 'rectangle'
cask 'redis-insight'
cask 'slack'
cask 'sonos'
cask 'specter'
cask 'spotify'
cask 'telegram'
cask 'tex-live-utility'
cask 'thunderbird'
cask 'tor-browser'
cask 'trainerroad'
cask 'trezor-suite'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wispr-flow'
cask 'xquartz'
cask 'zed'
cask 'zoom'
cask 'zotero'

# command line
brew 'adb-enhanced'
brew 'atuin'  # searchable shell history
brew 'awscli'
brew 'bat'  # modern cat with syntax highlighting
brew 'bitwarden-cli'
brew 'boost'
brew 'oven-sh/bun/bun'
brew 'cabal-install'
brew 'cmake'
brew 'cocoapods'
brew 'cortex'
brew 'csvkit'
brew 'curl'
brew 'direnv'  # per-directory .envrc environment variables
brew 'docker'
brew 'dotnet'
brew 'duckdb'
brew 'eza'  # modern ls replacement
brew 'fd'  # modern find alternative
brew 'ffmpeg'
brew 'fswatch'
brew 'fzf'  # fuzzy finder
brew 'gh'  # GitHub CLI
brew 'git'
brew 'git-delta'  # git diff pager with syntax highlighting
brew 'git-lfs'
brew 'gmime'
brew 'gnupg'
brew 'gnutls'
brew 'graphviz'
brew 'hadoop'
brew 'harlequin'  # terminal SQL IDE
brew 'htop'
brew 'imagemagick'
brew 'openjdk'
brew 'jq'
brew 'jordond/tap/jolt'
brew 'just'  # command runner
brew 'lazygit'  # terminal git UI
brew 'leiningen'
brew 'libcaca'
brew 'llmfit'
brew 'lua'
brew 'getmacro/terminal/macro'
brew 'maven'
brew 'mutagen-io/mutagen/mutagen'
brew 'neovim'
brew 'nvm'
brew 'openssl'
brew 'pandoc'
brew 'pgcli'
brew 'pinentry-mac'
brew 'podman'
brew 'postgis'
brew 'postgresql@17'
brew 'pspg'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'python@3.13'
brew 'qpdf'
brew 'r'
brew 'ranger'
brew 'rbenv'
brew 'readline'
brew 'ripgrep'  # modern grep alternative
brew 'rlwrap'
brew 'runpod/runpodctl/runpodctl'
brew 'rustup'
brew 'sbt'
brew 'scala'
brew 'scalastyle'
brew 'sevenzip'
brew 'shfmt'
brew 'snowflake-cli'
brew 'stow'
brew 'telnet'
brew 'terminal-notifier'  # desktop notifications for Claude Code hooks
brew 'tealdeer'  # simplified man pages (tldr client)
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'tor'
brew 'trash'
brew 'tree'
brew 'typst'
brew 'unixodbc'
brew 'vim'
brew 'vimpager'
brew 'wget'
brew 'wireguard-tools'
brew 'yarn'
brew 'yt-dlp'  # modern youtube-dl replacement
brew 'zoxide'  # modern fasd replacement
brew 'zsh'

# linuxifacation
brew 'coreutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'grep'

# email
brew 'mu'

# Emacs
cask 'emacs-app'
brew 'aspell'
brew 'enchant'  # for jinx spell-checking
brew 'ghostscript'  # for doc-view-mode
brew 'ispell'
brew 'surfraw'  # command-line web search
