# https://github.com/Homebrew/homebrew-bundle

# ```sh
# brew tap bundle
# brew bundle --global
# ```

tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/versions'

# fonts
tap 'caskroom/fonts'

cask 'font-fontawesome'
cask 'font-hack'

# applications
cask 'alfred'
cask 'appcleaner'
cask 'basictex'
cask 'calibre'
cask 'charles'
cask 'chromium'
cask 'dropbox'
cask 'enpass'
cask 'firefox'
cask 'fliqlo'
cask 'flux'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keybase'
cask 'kobo'
cask 'licecap'
cask 'liteicon'
cask 'mpv'
cask 'nosleep'
cask 'postico'
cask 'prey'  # requires API_KEY
cask 'react-native-debugger'
cask 'rodeo'
cask 'rstudio'
cask 'slack'
cask 'spotify'
cask 'spyder-py2'
cask 'ssh-tunnel-manager'
cask 'tex-live-utility'
cask 'tunnelblick'
cask 'xquartz'
cask 'zoomus'

# command line
brew 'R'
brew 'ag'
brew 'awscli'
brew 'cabal-install'
brew 'cocoapods'
brew 'curl'
brew 'docker'
brew 'docker-machine'
brew 'drake'
brew 'fasd'
brew 'fswatch'
brew 'git', args: ['with-brewed-curl', 'with-brewed-openssl']
brew 'gmime'
brew 'gnupg2', args: ['with-readline']
brew 'gnutls'
brew 'gpg-agent'
brew 'hadoop'
brew 'hive'
brew 'imagemagick'
brew 'jq'
brew 'leiningen'
brew 'libcaca'
brew 'lua'
brew 'maven'
brew 'openssl'
brew 'p7zip'
brew 'pandoc'
brew 'pinentry-mac'
brew 'postgresql'
brew 'pow'
brew 'python', args: ['with-brewed-openssl']
brew 'python3'
brew 'ranger'
brew 'rbenv'
brew 'readline'
brew 'rlwrap'
brew 's3cmd'
brew 'sbt'
brew 'scala'
brew 'scala', args: ['with-docs']
brew 'scalastyle'
brew 'tmux'
brew 'tmux-mem-cpu-load'
brew 'trash'
brew 'unrar'
brew 'vim', args: ['override-system-vi']
brew 'vimpager'
brew 'xclip'
brew 'youtube-dl'
brew 'yuicompressor'
brew 'zsh', args: ['without-etcdir']

# linuxifacation
brew 'coreutils'
brew 'ed', args: ['default-names']
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'grep', args: ['with-default-names']

# email
brew 'mu', args: ['HEAD', 'with-emacs']
brew 'offlineimap'

# Emacs
brew 'aspell', args: ['with-lang-en']
brew 'emacs', args: ['with-cocoa', 'with-dbus', 'with-gnutls', 'with-glib', 'with-imagemagick', 'with-librsvg', 'with-mailutils']
brew 'ghostscript'  # for doc-view-mode
brew 'surfraw'  # for the helm-surfraw command

## GIS
tap 'osgeo/osgeo4mac'

brew 'osmosis'
brew 'postgis'
brew 'qgis'
